[
    {
        "name": "trivago Exposure Algorithms",
        "description": "As a Java developer and later engineering lead at <a href=\"https://www.trivago.com\">trivago</a>, my team was responsible for the advertiser auction and hotel ranking for all searches. Our service ran billions of auctions daily, carefully optimizing trivago's revenue while balancing the interests of users, advertisers, and our company.",
        "img_src": "/assets/portfolio/trivago_exposure.png",
        "img_alt": "Screenshot of trivago.com showing the hotel results and advertised prices on each hotel",
        "repo": ""
    },
    {
        "name": "Japanese Segmenter",
        "description": "Japanese text has no spaces, and being confronted by a wall of text can be really intimidating for learners. For my client's product, I used my extensive knowledge of Japanese grammar to write a segmenter that outputs recognizable words. The result is simpler for learners to digest and understand, improving the product experience.",
        "img_src": "/assets/portfolio/ja_segmenting.jpg",
        "img_alt": "A page of Japanese text, shown with and without highlighting of individual words",
        "repo": null
    },
    {
        "name": "Car Navigation Assistant",
        "description": "I built an NLU agent used in Japanese cars sold in the US. The agent would respond to spoken commands such as, \"take me to John's house\" and \"where can I buy a Coke?\".",
        "img_src": "/assets/portfolio/car_navi.jpg",
        "img_alt": "A car navigation screen",
        "repo": ""
    },
    {
        "name": "Japanese ⇄ Turkish Machine Translation System",
        "description": "I built a custom translation system used in a Japanese rubber factory located in Turkey. The system handled the complex morphology of Turkish better than other state-of-the-art translation systems.",
        "img_src": "/assets/portfolio/tire_factory.jpg",
        "img_alt": "A freshly formed tire coming out of a factory machine, still steaming",
        "repo": ""
    }
]
